app/views/story_comments/_form.html.haml

= simple_form_for @story_comment, :html => { :class => 'form-horizontal' } do |f|
  = f.association :story, :required => true, :collection => Story.all.collect {|story| [story.content, story.id]}
---
SELECT "stories".* FROM "stories"