app/views/story_comments/index.html.haml

- model_class = StoryComment.new.class
.page-header
---
SELECT "story_comments".* FROM "story_comments"