app/views/users/index.html.haml

SELECT "users".* FROM "users"
---
- model_class = User.new.class
.page-header