app/views/stories/_form.html.haml

  = f.input :content, :as => :text, :input_html => { :rows  => 5 }
  = f.association :worker, :collection => User.all.collect {|user| [user.email, user.id]}
  .form-actions
---
SELECT "users".* FROM "users"