app/views/stories/index.html.haml

- model_class = Story.new.class
.page-header
---
SELECT "stories".* FROM "stories"