app/controllers/filter_stories_controller.rb

  def index
    @state = params[:state]
    @user  = params[:user]

    @stories =
      case [@state.nil?, @user.nil?]
        when [true, true] then
          Story.all
        when [true, false] then
          Story.where :user_id => params[:user]
        when [false, true] then
          Story.where :state => params[:state]
        else
          Story.where :state => params[:state], :user_id => params[:user]
---
SELECT "stories".* FROM "stories"
SELECT "stories".* FROM "stories" WHERE "stories"."user_id" = 2
SELECT "stories".* FROM "stories" WHERE "stories"."state" IS NULL
SELECT "stories".* FROM "stories" WHERE "stories"."state" = 4 AND "stories"."user_id" = 1