app/controllers/session_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'test@test.fr' LIMIT 1
---
  def create
    user = User.find_by_email params["session"]["email"]