app/controllers/story_comments_controller.rb

  def index
    @story_comments = StoryComment.all
---
SELECT "story_comments".* FROM "story_comments"

  def show
    @story_comment = StoryComment.find(params[:id])
---
SELECT "story_comments".* FROM "story_comments" WHERE "story_comments"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @story_comment = StoryComment.find(params[:id])
---
SELECT "story_comments".* FROM "story_comments" WHERE "story_comments"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @story_comment = StoryComment.new.build_from(params[:story_comment])

    respond_to do |format|
      if @story_comment.save
---
INSERT INTO "story_comments" ("content", "created_at", "story_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Blablabla"], ["created_at", Wed, 11 Jul 2012 13:41:38 UTC +00:00], ["story_id", 1], ["updated_at", Wed, 11 Jul 2012 13:41:38 UTC +00:00], ["user_id", 1]]

  def update
    @story_comment = StoryComment.find(params[:id])

    respond_to do |format|
      if @story_comment.update_attributes(params[:story_comment])
---
SELECT "story_comments".* FROM "story_comments" WHERE "story_comments"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "story_comments" SET "user_id" = 298486374, "updated_at" = '2012-07-08 07:08:01.362004', "story_id" = 980190962 WHERE "story_comments"."id" = 980190962

  def destroy
    @story_comment = StoryComment.find(params[:id])
    @story_comment.destroy
---
SELECT "story_comments".* FROM "story_comments" WHERE "story_comments"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "story_comments" WHERE "story_comments"."id" = ?  [["id", 980190962]]