app/controllers/stories_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "stories".* FROM "stories"
---
  def index
    @stories = Story.scoped

    @stories = @stories.where(:user_id => params[:user])  if params[:user].present?
    @stories = @stories.where(:state => params[:state]) if params[:state].present?

    respond_to do |format|
      format.html # index.html.erb
      format.json { render :json => @stories.all }

INSERT INTO "stories" ("content", "created_at", "state", "updated_at", "user_id", "worker_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "qwqeq"], ["created_at", Wed, 11 Jul 2012 12:10:44 UTC +00:00], ["state", 0], ["updated_at", Wed, 11 Jul 2012 12:10:44 UTC +00:00], ["user_id", 1], ["worker_id", 1]]
---
  def create
    @story = Story.new(params[:story])

    respond_to do |format|
      if @story.save

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "stories" SET "updated_at" = '2012-07-11 12:36:45.585447', "state" = 4 WHERE "stories"."id" = 1
---
  def update
    @story = Story.find(params[:id])

    respond_to do |format|
      if @story.update_attributes(params[:story])

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "stories" WHERE "stories"."id" = ?  [["id", 980190962]]
---
  def destroy
    @story = Story.find(params[:id])
    @story.destroy