app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 07 Jul 2012 10:14:00 UTC +00:00], ["email", "MyString"], ["password", "MyString"], ["updated_at", Sat, 07 Jul 2012 10:14:00 UTC +00:00]]

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "users" SET "updated_at" = '2012-07-11 12:33:30.949108', "password_digest" = '$2a$10$imaC90s3i141q/FGSTsOheKyN0aH9sGVWTgVcjcPKXHqrp7ds2/Da' WHERE "users"."id" = 1